xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_СтатусDSL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_СтатусDSL</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПрименяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанУспешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправляется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonModules/ИИА_AIInvocation/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура УстановитьОчередьMockОтветов(СсылкаДиалога, МассивMockОтветов) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) ИЛИ СсылкаДиалога.Пустая() Тогда
		Возврат;
	КонецЕсли;
	СтруктураДанных = ИИА_DialogStorage.ПолучитьДанныеДиалогаИзРегистра(СсылкаДиалога);
	Если СтруктураДанных = Неопределено ИЛИ ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		СтруктураДанных = Новый Структура;
	КонецЕсли;
	СтруктураДанных.Вставить("MockОтветыОчередь", МассивMockОтветов);
	ИИА_DialogStorage.ЗаписатьДанныеДиалогаВРегистр(СсылкаДиалога, СтруктураДанных);
КонецПроцедуры

Процедура ОчиститьОчередьMockОтветов(СсылкаДиалога) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) ИЛИ СсылкаДиалога.Пустая() Тогда
		Возврат;
	КонецЕсли;
	СтруктураДанных = ИИА_DialogStorage.ПолучитьДанныеДиалогаИзРегистра(СсылкаДиалога);
	Если СтруктураДанных = Неопределено ИЛИ ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	Если СтруктураДанных.Свойство("MockОтветыОчередь") Тогда
		СтруктураДанных.Удалить("MockОтветыОчередь");
		ИИА_DialogStorage.ЗаписатьДанныеДиалогаВРегистр(СсылкаДиалога, СтруктураДанных);
	КонецЕсли;
КонецПроцедуры

Функция ИсправитьDSLЧерезИИ(СсылкаДиалога, ТекстОшибки, ИсходныйDSL) Экспорт
	ТекстОшибкиСКонтекстом = ТекстОшибки;
	ТекстВРег = ВРег(ТекстОшибки);
	
	Если СтрНайти(ТекстОшибки, "RunQuery") > 0 
		ИЛИ СтрНайти(ТекстОшибки, "Запрос") > 0 
		ИЛИ СтрНайти(ТекстОшибки, "Синтаксическая ошибка") > 0 Тогда
		
		Если СтрНайти(ТекстОшибки, "Поле не найдено") > 0 Тогда
			ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + Символы.ПС +
			"СОВЕТ: Возможно, ты используешь неверные имена полей. Сначала выполни GetObjectFields, чтобы узнать точную структуру.";
		ИначеЕсли СтрНайти(ТекстОшибки, "не найден") > 0 Тогда
			ТипОбъекта = "";
			ИмяОбъекта = "";
			
			Если СтрНайти(ТекстОшибки, "Документ '") > 0 Тогда
				ТипОбъекта = "Документ";
			ИначеЕсли СтрНайти(ТекстОшибки, "Справочник '") > 0 Тогда
				ТипОбъекта = "Справочник";
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ТипОбъекта) Тогда
				ПозНачала = СтрНайти(ТекстОшибки, ТипОбъекта + " '") + СтрДлина(ТипОбъекта) + 2;
				ПозКонца = СтрНайти(ТекстОшибки, "'", НаправлениеПоиска.СНачала, ПозНачала);
				Если ПозКонца > 0 Тогда
					ИмяОбъекта = Сред(ТекстОшибки, ПозНачала, ПозКонца - ПозНачала);
					МассивПопыток = Новый Массив;
					МассивИстории = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 20);
					Для Каждого Сообщение Из МассивИстории Цикл
						Если Сообщение.Автор = Перечисления.ИИА_АвторСообщения.Система 
							И (СтрНайти(Сообщение.Текст, "table_not_found") > 0 ИЛИ СтрНайти(Сообщение.Текст, "не найден") > 0) Тогда
							ПозТ = СтрНайти(Сообщение.Текст, "Таблица '");
							Если ПозТ = 0 Тогда ПозТ = СтрНайти(Сообщение.Текст, "Объект '"); КонецЕсли;
							Если ПозТ > 0 Тогда
								ИмяТ = Сред(Сообщение.Текст, ПозТ + 9);
								ПозК = СтрНайти(ИмяТ, "'");
								Если ПозК > 0 Тогда
									ИмяТ = Лев(ИмяТ, ПозК - 1);
									Если МассивПопыток.Найти(ИмяТ) = Неопределено Тогда
										МассивПопыток.Добавить(ИмяТ);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Похожие = ИИА_Метаданные.НайтиПохожиеОбъекты(ИмяОбъекта, ТипОбъекта);
					ЧистыеПохожие = Новый Массив;
					Для Каждого Кандидат Из Похожие Цикл
						БылВПопытках = Ложь;
						Для Каждого ПрошлаяПопытка Из МассивПопыток Цикл
							Если ВРег(ПрошлаяПопытка) = ВРег(Кандидат) ИЛИ СтрНайти(ВРег(ПрошлаяПопытка), ВРег(Кандидат)) > 0 Тогда
								БылВПопытках = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если НЕ БылВПопытках Тогда
							ЧистыеПохожие.Добавить(Кандидат);
						КонецЕсли;
					КонецЦикла;
					
					ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + Символы.ПС +
					"!!! КРИТИЧЕСКАЯ ПОДСКАЗКА ДЛЯ ИСПРАВЛЕНИЯ !!!" + Символы.ПС +
					"Объект '" + ИмяОбъекта + "' не найден. ";
					
					Если МассивПопыток.Количество() > 0 Тогда
						ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + Символы.ПС +
						"ТЫ УЖЕ ПРОБОВАЛ И ОНИ НЕ ПОДОШЛИ: " + СтрСоединить(МассивПопыток, ", ") + ". ";
					КонецЕсли;
					
					Если ЧистыеПохожие.Количество() > 0 Тогда
						ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + "ВМЕСТО НЕГО ИСПОЛЬЗУЙ ОДИН ИЗ ЭТИХ ОБЪЕКТОВ: " + СтрСоединить(ЧистыеПохожие, ", ") + ". ";
						ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + "Твой следующий шаг ОБЯЗАН быть GetObjectFields для одного из этих имен!";
					Иначе
						ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + "Используй GetMetadata с фильтром для поиска точного имени.";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекстОшибки, "Синтаксическая ошибка") > 0 Тогда
			ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + Символы.ПС +
			"СОВЕТ: В запросе синтаксическая ошибка. Попробуй упростить запрос. " +
			"Если ты пытаешься найти последнюю запись, используй 'ВЫБРАТЬ ПЕРВЫЕ 1 ... УПОРЯДОЧИТЬ ПО Дата УБЫВ' вместо подзапросов с МАКСИМУМ.";
		КонецЕсли;
	КонецЕсли;
	
	Если СтрНайти(ТекстВРег, " RunQuery") > 0 
		ИЛИ СтрНайти(ТекстВРег, " ЗАПРОС") > 0 
		ИЛИ СтрНайти(ТекстВРег, "СИНТАКСИЧЕСКАЯ ОШИБКА") > 0 Тогда
		ТекстОшибкиСКонтекстом = ТекстОшибкиСКонтекстом + Символы.ПС + Символы.ПС +
		"ДЛЯ ИСПРАВЛЕНИЯ ОШИБКИ ИСПОЛЬЗУЙ ОФИЦИАЛЬНУЮ СПРАВКУ ПО ЯЗЫКУ ЗАПРОСОВ 1С:" + Символы.ПС +
		ИИА_Сервер.ПолучитьСправкуЗапросовПоОшибке(ТекстОшибки);
	КонецЕсли;
	
	ПромптИсправления = ИИА_Промты.ПолучитьПромптИсправленияDSL(ТекстОшибкиСКонтекстом, ИсходныйDSL);
	Температура = 0.7;
	Возврат ВызватьИИССистемнымСообщением(СсылкаДиалога, "Чат", ПромптИсправления, "", "dsl", Температура, Истина);
КонецФункции

Функция ВызватьИИССистемнымСообщением(СсылкаДиалога, ТипСообщения, ТекстСистемногоСообщения, СистемныйПромпт = "", ExpectedResponseFormat = "dsl", Температура = Неопределено, Знач ИспользоватьRAG = Ложь, Знач АвтоВыполнятьDSL = Истина) Экспорт
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Пользователь = Диалог.Пользователь;
	CallId = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыПользователя = ИИА_Сервер.ПолучитьНастройкиПользователя(Пользователь);
	ПараметрыПользователя.Вставить("Пользователь", Пользователь);
	ПараметрыПользователя.Вставить("ТипДиалога", Диалог.ТипДиалога);
	ПараметрыПользователя.Вставить("СсылкаДиалога", СсылкаДиалога);
	ПараметрыПользователя.Вставить("ИспользоватьRAG", ИспользоватьRAG);
	АрхКонтекст = ИИА_Сервер.ПолучитьКонтекстАрхитектуры(СсылкаДиалога);
	Если НЕ ПустаяСтрока(АрхКонтекст.trace_id) Тогда
		ПараметрыПользователя.Вставить("trace_id", АрхКонтекст.trace_id);
	КонецЕсли;
	Если НЕ ПустаяСтрока(АрхКонтекст.prompt_version) Тогда
		ПараметрыПользователя.Вставить("prompt_version", АрхКонтекст.prompt_version);
	КонецЕсли;
	ПараметрыПользователя.Вставить("ExpectedResponseFormat", ExpectedResponseFormat);
	
	Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
		КонтекстАктуальногоЗапроса = ИИА_Сервер.ПолучитьКонтекстАктуальногоЗапроса1СДляАгента(СсылкаДиалога);
		Если НЕ ПустаяСтрока(КонтекстАктуальногоЗапроса) Тогда
			ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС + Символы.ПС + КонтекстАктуальногоЗапроса;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных = ИИА_DialogStorage.ПолучитьДанныеДиалогаИзРегистра(СсылкаДиалога);
	Если СтруктураДанных <> Неопределено И ТипЗнч(СтруктураДанных) = Тип("Структура") И СтруктураДанных.Свойство("MockОтветыОчередь") Тогда
		Очередь = СтруктураДанных.MockОтветыОчередь;
		Если ТипЗнч(Очередь) = Тип("Массив") И Очередь.Количество() > 0 Тогда
			ВзятыйMock = Очередь[0];
			Очередь.Удалить(0);
			СтруктураДанных.MockОтветыОчередь = Очередь;
			ИИА_DialogStorage.ЗаписатьДанныеДиалогаВРегистр(СсылкаДиалога, СтруктураДанных);
			ПараметрыПользователя.Вставить("MockОтвет", ВзятыйMock);
		КонецЕсли;
	КонецЕсли;
	
	МассивИстории = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 50);
	DiscoveryНайдено = Ложь;
	КоличествоИстории = МассивИстории.Количество();
	Если КоличествоИстории > 0 Тогда
		Для Индекс = КоличествоИстории - 1 По 0 Цикл
			СтрокаИст = МассивИстории[Индекс];
			Если СтрокаИст.Автор = Перечисления.ИИА_АвторСообщения.Система Тогда
				ЭтоDiscovery = (СтрНайти(СтрокаИст.Текст, "Получены метаданные") > 0 ИЛИ СтрНайти(СтрокаИст.Текст, "Получены реквизиты") > 0);
				Если ЭтоDiscovery Тогда
					Если DiscoveryНайдено Тогда
						ПозПС = СтрНайти(СтрокаИст.Текст, Символы.ПС);
						Если ПозПС > 0 Тогда
							СтрокаИст.Текст = Лев(СтрокаИст.Текст, ПозПС) + "...(старые данные удалены для экономии контекста)";
						КонецЕсли;
					Иначе
						DiscoveryНайдено = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	История = ИИА_Сервер.ПреобразоватьМассивСообщенийВТаблицу(МассивИстории);
	ОтветИИ = ИИА_Провайдеры.ВызватьИИ(ТипСообщения, ТекстСистемногоСообщения, История, ПараметрыПользователя, СистемныйПромпт, Температура);
	Если НЕ ОтветИИ.Свойство("Промпт") Тогда
		ОтветИИ.Вставить("Промпт", "");
	КонецЕсли;
	
	МодельДляЛога = ?(ПараметрыПользователя.Свойство("Модель") И НЕ ПустаяСтрока(ПараметрыПользователя.Модель), ПараметрыПользователя.Модель, "gpt-5.4-nano");
	ТекстЛога = "[LLM_REQUEST] CallId=" + CallId + ", Type=" + ТипСообщения + ", ExpectedResponseFormat=" + ExpectedResponseFormat + ", Model=" + МодельДляЛога;
	Если НЕ ПустаяСтрока(АрхКонтекст.trace_id) Тогда
		ТекстЛога = ТекстЛога + ", TraceId=" + АрхКонтекст.trace_id;
	КонецЕсли;
	Если НЕ ПустаяСтрока(АрхКонтекст.prompt_version) Тогда
		ТекстЛога = ТекстЛога + ", PromptVersion=" + АрхКонтекст.prompt_version;
	КонецЕсли;
	ТекстЛога = ТекстЛога + ", Temperature=" + ?(Температура <> Неопределено, Строка(Температура), "0.0");
	ТекстЛога = ТекстЛога + Символы.ПС + ИИА_DialogLog.СжатьJSONВСтроку(ОтветИИ.Промпт);
	ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ТекстЛога, "LLM_REQUEST", CallId);
	
	Если ОтветИИ.Свойство("RawModelText") И НЕ ПустаяСтрока(Строка(ОтветИИ.RawModelText)) Тогда
		RawText = Строка(ОтветИИ.RawModelText);
	ИначеЕсли ОтветИИ.Свойство("ToolArguments") И НЕ ПустаяСтрока(Строка(ОтветИИ.ToolArguments)) Тогда
		RawText = Строка(ОтветИИ.ToolArguments);
	Иначе
		RawText = ОтветИИ.Текст;
	КонецЕсли;
	RawTextДляЛога = RawText;
	Обрезанный = СокрЛП(RawText);
	Если (СтрНайти(Обрезанный, "[") = 1 ИЛИ СтрНайти(Обрезанный, "{") = 1) И СтрДлина(RawText) > 200 Тогда
		RawTextДляЛога = ИИА_DialogLog.СжатьJSONВСтроку(RawText);
	КонецЕсли;
	ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[LLM_RESPONSE_RAW] CallId=" + CallId + Символы.ПС + RawTextДляЛога, "LLM_RESPONSE_RAW", CallId);
	
	НормализованныйJSON = ИИА_DSL.НормализоватьJSONТекст(RawText);
	Если НЕ ПустаяСтрока(НормализованныйJSON) И СокрЛП(НормализованныйJSON) <> СокрЛП(RawText) Тогда
		ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[LLM_RESPONSE_NORMALIZED_JSON] CallId=" + CallId + Символы.ПС + ИИА_DialogLog.СжатьJSONВСтроку(НормализованныйJSON), "LLM_RESPONSE_NORMALIZED_JSON", CallId);
	КонецЕсли;
	
	UsageText = "";
	UsageTokens = 0;
	Если ОтветИИ.Свойство("Usage") И ОтветИИ.Usage <> Неопределено И ТипЗнч(ОтветИИ.Usage) = Тип("Структура") И ОтветИИ.Usage.Свойство("TotalTokens") Тогда
		UsageText = Символы.ПС + "[Usage] TotalTokens=" + Строка(ОтветИИ.Usage.TotalTokens);
		UsageTokens = ОтветИИ.Usage.TotalTokens;
	КонецЕсли;
	СкрытоеСлужебноеОтвета = (ExpectedResponseFormat = "plan");
	
	ТекстДлина = ?(ОтветИИ.Свойство("Текст") И НЕ ПустаяСтрока(ОтветИИ.Текст), СтрДлина(ОтветИИ.Текст), 0);
	DSLДляЛога = ?(ОтветИИ.Свойство("DSL") И НЕ ПустаяСтрока(ОтветИИ.DSL), Символы.ПС + "[DSL]" + Символы.ПС + ИИА_DialogLog.СжатьJSONВСтроку(ОтветИИ.DSL), "");
	ToolДляЛога = "";
	Если ОтветИИ.Свойство("ToolName") И НЕ ПустаяСтрока(Строка(ОтветИИ.ToolName)) Тогда
		ToolДляЛога = ", ToolName=" + Строка(ОтветИИ.ToolName);
	КонецЕсли;
	Если ОтветИИ.Свойство("FinishReason") И НЕ ПустаяСтрока(Строка(ОтветИИ.FinishReason)) Тогда
		ToolДляЛога = ToolДляЛога + ", FinishReason=" + Строка(ОтветИИ.FinishReason);
	КонецЕсли;
	ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[LLM_RESPONSE_PARSED] CallId=" + CallId + ", ParsedKind=" + ExpectedResponseFormat + ", ТипОтвета=" + ОтветИИ.ТипОтвета + ToolДляЛога + ?(ТекстДлина > 0, ", TextLen=" + Формат(ТекстДлина, "ЧН=0"), "") + UsageText + DSLДляЛога, "LLM_RESPONSE_PARSED", CallId);
	
	Если ОтветИИ.ТипОтвета = "Ошибка" ИЛИ ОтветИИ.ТипОтвета = "ОшибкаКонтракта" Тогда
		Если ОтветИИ.Свойство("RawModelText") И НЕ ПустаяСтрока(Строка(ОтветИИ.RawModelText)) Тогда
			ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.ИИ, Перечисления.ИИА_ТипСообщения.Текст, Строка(ОтветИИ.RawModelText), "", "", UsageTokens, Неопределено, "", СкрытоеСлужебноеОтвета);
			ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[LLM_RESPONSE_RAW_AS_DIALOG_MESSAGE] CallId=" + CallId, "LLM_RESPONSE_RAW_AS_DIALOG_MESSAGE", CallId);
		КонецЕсли;
		ТекстОшибкиСообщение = ОтветИИ.Текст;
		Если ОтветИИ.Свойство("Ошибки") И ОтветИИ.Ошибки <> Неопределено Тогда
			ТекстОшибок = ИИА_Провайдеры.ПредставлениеОшибкиИнструмента(ОтветИИ.Ошибки);
			Если НЕ ПустаяСтрока(ТекстОшибок) Тогда
				ТекстОшибкиСообщение = ТекстОшибкиСообщение + Символы.ПС + "Детали: " + ТекстОшибок;
			КонецЕсли;
		КонецЕсли;
		ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Ошибка, ТекстОшибкиСообщение);
		Возврат ОтветИИ;
	КонецЕсли;
	
	Если ОтветИИ.ТипОтвета = "Запрос" Тогда
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Запрос;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = ОтветИИ.Запрос;
	ИначеЕсли ОтветИИ.ТипОтвета = "DSL" Тогда
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Код;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = ?(ОтветИИ.Свойство("DSL") И НЕ ПустаяСтрока(ОтветИИ.DSL), ОтветИИ.DSL, "");
	Иначе
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Текст;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = "";
	КонецЕсли;
	
	СтатусDSLСообщения = Неопределено;
	Если ОтветИИ.ТипОтвета = "DSL" И (НЕ ПустаяСтрока(ТекстКодаОтвета) ИЛИ НЕ ПустаяСтрока(ОтветИИ.DSL)) Тогда
		СтатусDSLСообщения = Перечисления.ИИА_СтатусDSL.ВОчереди;
	КонецЕсли;
	ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.ИИ, ТипСообщенияОтвета, ТекстОтвета, ТекстКодаОтвета, "", UsageTokens, СтатусDSLСообщения, "", СкрытоеСлужебноеОтвета);
	
	Если ОтветИИ.ТипОтвета = "DSL" И НЕ ПустаяСтрока(ОтветИИ.DSL) И АвтоВыполнятьDSL Тогда
		ТолькоЧтение = (СсылкаДиалога.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С);
		Если ПараметрыПользователя.Свойство("ДоступнаЗапись") И НЕ ПараметрыПользователя.ДоступнаЗапись Тогда
			ТолькоЧтение = Истина;
		КонецЕсли;
		РезультатDSL = ИИА_DSL.ВыполнитьDSL(ОтветИИ.DSL, СсылкаДиалога, ТолькоЧтение);
		Если РезультатDSL.Успех Тогда
			ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.ОбработанУспешно);
			ТекстСистемногоОтвета = ?(РезультатDSL.Свойство("СистемныйОтвет") И НЕ ПустаяСтрока(РезультатDSL.СистемныйОтвет), РезультатDSL.СистемныйОтвет, "{""kind"":""dsl_system_result"",""schema_version"":1,""success"":false,""error"":""Системный ответ DSL пуст""}");
			ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, СокрЛП(ТекстСистемногоОтвета), "", "", 0);
			Если РезультатDSL.Свойство("СсылкиОбъектов") И РезультатDSL.СсылкиОбъектов.Количество() > 0 Тогда
				МассивСсылок = РезультатDSL.СсылкиОбъектов;
				ИИА_Сервер.ДобавитьИзмененныеОбъекты(СсылкаДиалога, МассивСсылок);
				ТекстСсылок = ?(МассивСсылок.Количество() = 1, "Объект: " + МассивСсылок[0], "Создано/изменено объектов: " + Формат(МассивСсылок.Количество(), "ЧН=0"));
				Если МассивСсылок.Количество() > 1 Тогда
					Для Каждого СсылкаОбъекта Из МассивСсылок Цикл
						ТекстСсылок = ТекстСсылок + Символы.ПС + "- " + СсылкаОбъекта;
					КонецЦикла;
				КонецЕсли;
				ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, ТекстСсылок, "", "", 0);
			КонецЕсли;
		Иначе
			ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.ОбработанСОшибкой);
			ТекстОшибки = ?(РезультатDSL.Свойство("СистемныйОтвет") И НЕ ПустаяСтрока(РезультатDSL.СистемныйОтвет), РезультатDSL.СистемныйОтвет, "{""kind"":""dsl_system_result"",""schema_version"":1,""success"":false,""error"":""Ошибка выполнения DSL: " + РезультатDSL.Сообщение + """}");
			ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Ошибка, ТекстОшибки, "", "", 0);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтветИИ;
КонецФункции

Функция ОтправитьСообщениеСервера(СсылкаДиалога, ТипСообщения, ТекстПользователя) Экспорт
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Пользователь = Диалог.Пользователь;
	
	СтандартноеНаименование = "Диалог ИИ от ";
	Если Лев(Диалог.Наименование, СтрДлина(СтандартноеНаименование)) = СтандартноеНаименование И НЕ ПустаяСтрока(ТекстПользователя) Тогда
		НовоеНаименование = СокрЛП(ТекстПользователя);
		НовоеНаименование = СтрЗаменить(НовоеНаименование, Символы.ПС, " ");
		НовоеНаименование = СтрЗаменить(НовоеНаименование, Символы.ВТаб, " ");
		Если СтрДлина(НовоеНаименование) > 50 Тогда
			НовоеНаименование = Лев(НовоеНаименование, 47) + "...";
		КонецЕсли;
		Диалог.Наименование = НовоеНаименование;
		Диалог.Записать();
		ИИА_Сервер.УведомитьОбОбновленииДиалога(СсылкаДиалога, "НовоеСообщение");
	КонецЕсли;

	Если ТипЗнч(ТипСообщения) = Тип("ПеречислениеСсылка.ИИА_ТипДиалога") Тогда
		Если Диалог.ТипДиалога <> ТипСообщения Тогда
			Диалог.ТипДиалога = ТипСообщения;
			Диалог.Записать();
			ИИА_Сервер.УведомитьОбОбновленииДиалога(СсылкаДиалога, "НовоеСообщение");
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыИИ = ИИА_Сервер.ПолучитьНастройкиПользователя(Пользователь);
	ПараметрыИИ.Вставить("Пользователь", Пользователь);
	ПараметрыИИ.Вставить("ТипДиалога", Диалог.ТипДиалога);
	ПараметрыИИ.Вставить("СсылкаДиалога", СсылкаДиалога);
	
	ПараметрыRAG = ИИА_Сервер.ОпределитьRAGДляСообщения(ТекстПользователя, Диалог.ТипДиалога);
	ПараметрыИИ.Вставить("ИспользоватьRAG", ПараметрыRAG.ИспользоватьRAG);
	Если ЗначениеЗаполнено(СсылкаДиалога) Тогда
		ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[RAG_DECISION] Пользователь: " + ?(ПараметрыRAG.ИспользоватьRAG, "включен", "выключен") + ". " + ПараметрыRAG.Причина);
	КонецЕсли;
	
	МассивИстории = ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, 10);
	История = ИИА_Сервер.ПреобразоватьМассивСообщенийВТаблицу(МассивИстории);
	
	Если ТипСообщения = "Запрос" Тогда
		ТипСообщенияДляХранения = Перечисления.ИИА_ТипСообщения.Запрос;
	Иначе
		ТипСообщенияДляХранения = Перечисления.ИИА_ТипСообщения.Текст;
	КонецЕсли;
	
	ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Пользователь, ТипСообщенияДляХранения, ТекстПользователя);

	Если Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Агент ИЛИ Диалог.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С Тогда
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		Если НЕ ИИА_TypedPlan.ПланЗавершен(СсылкаДиалога) Тогда
			Диалог.План.Очистить();
			Диалог.Записать();
		Иначе
			ИИА_DialogLog.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, "[План] Завершенный план оставлен для асинхронного дополнения оркестратором.");
		КонецЕсли;
		ИИА_Сервер.УведомитьОбОбновленииДиалога(СсылкаДиалога, "ЗапросПринят");
		
		Результат = Новый Структура;
		Результат.Вставить("ТипОтвета", "Текст");
		Результат.Вставить("Текст", "Запрос принят. Начинаю планирование...");
		Результат.Вставить("Usage", Новый Структура("TotalTokens", 0));
		Возврат Результат;
	КонецЕсли;

	ИИА_Сервер.СброситьРезультатПроверкиВХранилище(СсылкаДиалога);
	ОтветИИ = ИИА_Провайдеры.ВызватьИИ(ТипСообщения, ТекстПользователя, История, ПараметрыИИ);
	Если НЕ ОтветИИ.Свойство("Промпт") Тогда
		ОтветИИ.Вставить("Промпт", "");
	КонецЕсли;
	
	Если ОтветИИ.ТипОтвета = "Ошибка" ИЛИ ОтветИИ.ТипОтвета = "ОшибкаКонтракта" Тогда
		Если ОтветИИ.Свойство("RawModelText") И НЕ ПустаяСтрока(Строка(ОтветИИ.RawModelText)) Тогда
			ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.ИИ, Перечисления.ИИА_ТипСообщения.Текст, Строка(ОтветИИ.RawModelText));
		КонецЕсли;
		ТекстОшибкиСообщение = ОтветИИ.Текст;
		Если ОтветИИ.Свойство("Ошибки") И НЕ ПустаяСтрока(Строка(ОтветИИ.Ошибки)) Тогда
			ТекстОшибкиСообщение = ТекстОшибкиСообщение + Символы.ПС + "Детали: " + Строка(ОтветИИ.Ошибки);
		КонецЕсли;
		ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Ошибка, ТекстОшибкиСообщение);
		Возврат ОтветИИ;
	ИначеЕсли ОтветИИ.ТипОтвета = "Запрос" Тогда
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Запрос;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = ОтветИИ.Запрос;
	ИначеЕсли ОтветИИ.ТипОтвета = "DSL" Тогда
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Код;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = ?(ОтветИИ.Свойство("DSL") И НЕ ПустаяСтрока(ОтветИИ.DSL), ОтветИИ.DSL, "");
	Иначе
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Текст;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = "";
	КонецЕсли;
	
	UsageTokens = 0;
	Если ОтветИИ.Свойство("Usage") И ОтветИИ.Usage <> Неопределено Тогда
		Если ТипЗнч(ОтветИИ.Usage) = Тип("Структура") И ОтветИИ.Usage.Свойство("TotalTokens") Тогда
			UsageTokens = ОтветИИ.Usage.TotalTokens;
		КонецЕсли;
	КонецЕсли;
	
	СтатусDSLСообщения = Неопределено;
	Если ОтветИИ.ТипОтвета = "DSL" И (НЕ ПустаяСтрока(ТекстКодаОтвета) ИЛИ НЕ ПустаяСтрока(ОтветИИ.DSL)) Тогда
		СтатусDSLСообщения = Перечисления.ИИА_СтатусDSL.ВОчереди;
	КонецЕсли;
	
	ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.ИИ, ТипСообщенияОтвета, ТекстОтвета, ТекстКодаОтвета, "", UsageTokens, СтатусDSLСообщения);
	
	Если ОтветИИ.ТипОтвета = "DSL" И НЕ ПустаяСтрока(ОтветИИ.DSL) Тогда
		РезультатDSL = ИИА_AIInvocation.ВыполнитьDSLСценарий(ОтветИИ.DSL, СсылкаДиалога);
		ОтветИИ.Вставить("РезультатDSL", РезультатDSL);
		ОтветИИ.Вставить("DSLJSON", ОтветИИ.DSL);
		
		Если РезультатDSL.Успех Тогда
			ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.ОбработанУспешно);
			ТекстСистемногоСообщения = ?(РезультатDSL.Свойство("СистемныйОтвет") И НЕ ПустаяСтрока(РезультатDSL.СистемныйОтвет), РезультатDSL.СистемныйОтвет, "{""kind"":""dsl_system_result"",""schema_version"":1,""success"":false,""error"":""Системный ответ DSL пуст""}");
			ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, СокрЛП(ТекстСистемногоСообщения), "", "", 0);
			
			Если РезультатDSL.Свойство("СсылкиОбъектов") И РезультатDSL.СсылкиОбъектов.Количество() > 0 Тогда
				МассивСсылок = РезультатDSL.СсылкиОбъектов;
				ИИА_Сервер.ДобавитьИзмененныеОбъекты(СсылкаДиалога, МассивСсылок);
				ТекстСсылок = ?(МассивСсылок.Количество() = 1, "Объект: " + МассивСсылок[0], "Создано/изменено объектов: " + Формат(МассивСсылок.Количество(), "ЧН=0"));
				Если МассивСсылок.Количество() > 1 Тогда
					Для Каждого СсылкаОбъекта Из МассивСсылок Цикл
						ТекстСсылок = ТекстСсылок + Символы.ПС + "- " + СсылкаОбъекта;
					КонецЦикла;
				КонецЕсли;
				ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, ТекстСсылок, "", "", 0);
			КонецЕсли;
		Иначе
			ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.ОбработанСОшибкой);
			ТекстОшибки = ?(РезультатDSL.Свойство("СистемныйОтвет") И НЕ ПустаяСтрока(РезультатDSL.СистемныйОтвет), РезультатDSL.СистемныйОтвет, "{""kind"":""dsl_system_result"",""schema_version"":1,""success"":false,""error"":""Ошибка выполнения DSL: " + РезультатDSL.Сообщение + """}");
			ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Ошибка, ТекстОшибки, "", "", 0);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстКодаОтвета) И ОтветИИ.ТипОтвета <> "DSL" Тогда
		Если ОтветИИ.ТипОтвета = "Запрос" Тогда
			ТекстСистемногоСообщения = "Запрос сгенерирован.";
		Иначе
			ТекстСистемногоСообщения = "ИИ сгенерировал код.";
		КонецЕсли;
		ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, ТекстСистемногоСообщения, "", "", 0);
	КонецЕсли;
	
	Возврат ОтветИИ;
КонецФункции

Функция ВыполнитьDSLСценарий(DSLJSON, СсылкаДиалога = Неопределено) Экспорт
	ТолькоЧтение = ОпределитьТолькоЧтениеDSL(СсылкаДиалога);
	РезультатDSL = ИИА_DSL.ВыполнитьDSL(DSLJSON, СсылкаДиалога, ТолькоЧтение);
	
	Если РезультатDSL.Успех Тогда
		Если РезультатDSL.Свойство("ДанныеЗапросаДляТаблицы") И РезультатDSL.ДанныеЗапросаДляТаблицы <> Неопределено Тогда
			Если ЗначениеЗаполнено(СсылкаДиалога) Тогда
				Если РезультатDSL.Свойство("ПоследнийЗапрос1С") Тогда
					ИИА_Сервер.УстановитьСостояниеЗапроса1СВХранилище(
						СсылкаДиалога,
						РезультатDSL.ДанныеЗапросаДляТаблицы,
						РезультатDSL.ПоследнийЗапрос1С
					);
				Иначе
					ИИА_Сервер.УстановитьДанныеЗапросаВХранилище(СсылкаДиалога, РезультатDSL.ДанныеЗапросаДляТаблицы);
				КонецЕсли;
			КонецЕсли;
			Если НужноОткрыватьТабличныйДокумент(РезультатDSL.ДанныеЗапросаДляТаблицы) Тогда
				РезультатDSL.Вставить("ОткрытьТабличныйДокумент", Истина);
				РезультатDSL.Вставить("ДанныеЗапроса", РезультатDSL.ДанныеЗапросаДляТаблицы);
			КонецЕсли;
		ИначеЕсли РезультатDSL.Результаты.Количество() > 0 Тогда
			Для Каждого РезультатШага Из РезультатDSL.Результаты Цикл
				Если РезультатШага.Свойство("ТипДействия") И РезультатШага.ТипДействия = "ShowInfo" И
				   РезультатШага.Свойство("ЕстьРезультатЗапроса") И РезультатШага.ЕстьРезультатЗапроса Тогда
					Если РезультатDSL.Свойство("ДанныеЗапросаДляТаблицы")
						И НужноОткрыватьТабличныйДокумент(РезультатDSL.ДанныеЗапросаДляТаблицы) Тогда
						РезультатDSL.Вставить("ОткрытьТабличныйДокумент", Истина);
						РезультатDSL.Вставить("ДанныеЗапроса", РезультатDSL.ДанныеЗапросаДляТаблицы);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатDSL;
КонецФункции

Функция ВыполнитьDSLСценарийБезСообщений(DSLJSON, СсылкаДиалога = Неопределено) Экспорт
	ТолькоЧтение = ОпределитьТолькоЧтениеDSL(СсылкаДиалога);
	Возврат ИИА_DSL.ВыполнитьDSL(DSLJSON, СсылкаДиалога, ТолькоЧтение);
КонецФункции

Функция НужноОткрыватьТабличныйДокумент(ДанныеЗапроса)
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗапроса) <> Тип("Массив") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ДанныеЗапроса.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ДанныеЗапроса.Количество() > 1 Тогда
		Возврат Истина;
	КонецЕсли;
	ПерваяСтрока = ДанныеЗапроса[0];
	Если ТипЗнч(ПерваяСтрока) = Тип("Структура") Тогда
		Возврат ПерваяСтрока.Количество() > 1;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSLJSON) Экспорт
	ТолькоЧтение = ОпределитьТолькоЧтениеDSL(СсылкаДиалога);
	ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.Выполняется);
	
	КонтекстВыполнения = Новый Структура;
	КонтекстВыполнения.Вставить("СсылкаДиалога", СсылкаДиалога);
	
	РезультатDSL = ИИА_DSL.ВыполнитьDSL(DSLJSON, СсылкаДиалога, ТолькоЧтение);
	
	Если РезультатDSL <> Неопределено И РезультатDSL.Успех
		И РезультатDSL.Свойство("ДанныеЗапросаДляТаблицы")
		И РезультатDSL.ДанныеЗапросаДляТаблицы <> Неопределено Тогда
		Если РезультатDSL.Свойство("ПоследнийЗапрос1С") Тогда
			ИИА_Сервер.УстановитьСостояниеЗапроса1СВХранилище(
				СсылкаДиалога,
				РезультатDSL.ДанныеЗапросаДляТаблицы,
				РезультатDSL.ПоследнийЗапрос1С
			);
		Иначе
			ИИА_Сервер.УстановитьДанныеЗапросаВХранилище(СсылкаДиалога, РезультатDSL.ДанныеЗапросаДляТаблицы);
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатDSL.Свойство("СистемныйОтвет") И НЕ ПустаяСтрока(РезультатDSL.СистемныйОтвет) Тогда
		ИИА_Сервер.ДобавитьСообщениеВДиалог(
			СсылкаДиалога,
			Перечисления.ИИА_АвторСообщения.Система,
			Перечисления.ИИА_ТипСообщения.Текст,
			СокрЛП(РезультатDSL.СистемныйОтвет),
			"",
			"",
			0
		);
	КонецЕсли;
	
	Если РезультатDSL.Успех Тогда
		ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.ОбработанУспешно);
		ТекстСистемногоСообщения = "DSL-сценарий выполнен успешно.";
		
		Если РезультатDSL.Результаты.Количество() > 0 Тогда
			Для Каждого РезультатШага Из РезультатDSL.Результаты Цикл
				Если РезультатШага.Свойство("ТипДействия") И РезультатШага.ТипДействия = "ShowInfo" И
				   НЕ ПустаяСтрока(РезультатШага.Сообщение) Тогда
					ИИА_Сервер.ДобавитьСообщениеВДиалог(
						СсылкаДиалога,
						Перечисления.ИИА_АвторСообщения.ИИ,
						Перечисления.ИИА_ТипСообщения.Текст,
						РезультатШага.Сообщение,
						"",
						"",
						0
					);
					Если РезультатШага.Свойство("ЕстьРезультатЗапроса") И РезультатШага.ЕстьРезультатЗапроса Тогда
						Если РезультатDSL.Свойство("ДанныеЗапросаДляТаблицы")
							И НужноОткрыватьТабличныйДокумент(РезультатDSL.ДанныеЗапросаДляТаблицы) Тогда
							РезультатDSL.Вставить("ОткрытьТабличныйДокумент", Истина);
							РезультатDSL.Вставить("ДанныеЗапроса", РезультатDSL.ДанныеЗапросаДляТаблицы);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли РезультатШага.Свойство("ТипДействия") И РезультатШага.ТипДействия = "RunQuery" И
				   РезультатШага.Свойство("ЕстьРезультатЗапроса") И РезультатШага.ЕстьРезультатЗапроса Тогда
					Если РезультатDSL.Свойство("ДанныеЗапросаДляТаблицы")
						И НужноОткрыватьТабличныйДокумент(РезультатDSL.ДанныеЗапросаДляТаблицы) Тогда
						РезультатDSL.Вставить("ОткрытьТабличныйДокумент", Истина);
						РезультатDSL.Вставить("ДанныеЗапроса", РезультатDSL.ДанныеЗапросаДляТаблицы);
					КонецЕсли;
				Иначе
					ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС + "- " + РезультатШага.Сообщение;
					
					Если РезультатШага.Свойство("ТипДействия") И РезультатШага.ТипДействия = "GetMetadata" Тогда
						Если РезультатШага.Свойство("Данные") И ТипЗнч(РезультатШага.Данные) = Тип("Структура") Тогда
							Если РезультатШага.Данные.Свойство("Документы") Тогда
								МассивДокументов = РезультатШага.Данные.Документы;
								Если МассивДокументов.Количество() > 0 И МассивДокументов.Количество() <= 5 Тогда
									ЛучшийКандидат = МассивДокументов[0].Имя;
									ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС +
									"!!! ВНИМАНИЕ: Твой следующий шаг ОБЯЗАН быть GetObjectFields для Документ." + ЛучшийКандидат + " !!!";
									
									ШагАвтопилота = Новый Структура("action,object_type,object_name", "GetObjectFields", "Документ", ЛучшийКандидат);
									РезультатАвтопилота = ИИА_DSL.ВыполнитьШаг(ШагАвтопилота, КонтекстВыполнения);
									Если РезультатАвтопилота.Успех Тогда
										ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС +
										"ИНФО: Я уже выполнил GetObjectFields за тебя. Вот реквизиты объекта '" + ЛучшийКандидат + "':";
										ДанныеОбъекта = РезультатАвтопилота.Данные;
										Если ТипЗнч(ДанныеОбъекта) = Тип("Структура") И ДанныеОбъекта.Свойство("Реквизиты") Тогда
											Для Каждого Реквизит Из ДанныеОбъекта.Реквизиты Цикл
												ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС + "  - " + Реквизит.Имя + " [синоним: " + Реквизит.Синоним + "]";
											КонецЦикла;
										КонецЕсли;
										ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС +
										"ТЕПЕРЬ ВЫПОЛНИ RunQuery К ЭТОМУ ОБЪЕКТУ! Используй только техническое имя поля до [синоним: ...].";
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					Если РезультатШага.Свойство("ТипДействия") И РезультатШага.ТипДействия = "GetObjectFields"
						И РезультатШага.Свойство("Данные") И РезультатШага.Данные <> Неопределено Тогда
						ДанныеОбъекта = РезультатШага.Данные;
						Если ТипЗнч(ДанныеОбъекта) = Тип("Структура") И ДанныеОбъекта.Свойство("Реквизиты") Тогда
							МассивРеквизитов = ДанныеОбъекта.Реквизиты;
							Если ТипЗнч(МассивРеквизитов) = Тип("Массив") И МассивРеквизитов.Количество() > 0 Тогда
								ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС + "Реквизиты:";
								Для Каждого Реквизит Из МассивРеквизитов Цикл
									Если ТипЗнч(Реквизит) = Тип("Структура") И Реквизит.Свойство("Имя") Тогда
										ИмяРеквизита = Реквизит.Имя;
										Если Реквизит.Свойство("Синоним") И НЕ ПустаяСтрока(Реквизит.Синоним) Тогда
											ИмяРеквизита = ИмяРеквизита + " [синоним: " + Реквизит.Синоним + "]";
										КонецЕсли;
										ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС + "  - " + ИмяРеквизита;
									КонецЕсли;
								КонецЦикла;
								ТекстСистемногоСообщения = ТекстСистемногоСообщения + Символы.ПС +
								"Для RunQuery используй только техническое имя поля до [синоним: ...].";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИИА_Сервер.ДобавитьСообщениеВДиалог(
			СсылкаДиалога,
			Перечисления.ИИА_АвторСообщения.Система,
			Перечисления.ИИА_ТипСообщения.Текст,
			ТекстСистемногоСообщения,
			"",
			"",
			0
		);
		
		Если РезультатDSL.Свойство("СсылкиОбъектов") Тогда
			МассивСсылок = РезультатDSL.СсылкиОбъектов;
			Если МассивСсылок.Количество() > 0 Тогда
				Попытка
					ИИА_Сервер.ДобавитьИзмененныеОбъекты(СсылкаДиалога, МассивСсылок);
					ТекстСсылок = "Создано/изменено объектов: " + Формат(МассивСсылок.Количество(), "ЧН=0") + Символы.ПС;
					ТекстСсылок = ТекстСсылок + ИИА_Сервер.ПолучитьДанныеСозданныхОбъектов(МассивСсылок);
					ИИА_Сервер.ДобавитьСообщениеВДиалог(
						СсылкаДиалога,
						Перечисления.ИИА_АвторСообщения.Система,
						Перечисления.ИИА_ТипСообщения.Текст,
						ТекстСсылок,
						"",
						"",
						0
					);
				Исключение
					ИИА_Сервер.ДобавитьСообщениеВДиалог(
						СсылкаДиалога,
						Перечисления.ИИА_АвторСообщения.Система,
						Перечисления.ИИА_ТипСообщения.Ошибка,
						"Ошибка при формировании сообщения со ссылками: " + ОписаниеОшибки(),
						"",
						"",
						0
					);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, Перечисления.ИИА_СтатусDSL.ОбработанСОшибкой);
		ТекстОшибки = "Ошибка выполнения DSL: " + РезультатDSL.Сообщение;
		Если ТолькоЧтение И (СтрНайти(ТекстОшибки, "RunQuery") > 0 ИЛИ СтрНайти(ТекстОшибки, "Запрос") > 0) Тогда
			Если СтрНайти(ТекстОшибки, "Поле не найдено") > 0 Тогда
				ТекстСправки = "СОВЕТ: Система не нашла указанное поле. Возможно, ты используешь неверное имя (синоним вместо имени). " +
				"Рекомендуется сначала выполнить действие GetObjectFields для этой таблицы, чтобы узнать точные имена полей.";
			Иначе
				ТекстСправки = "ВНИМАНИЕ! Обнаружена ошибка выполнения запроса 1С. " + Символы.ПС +
				"Используйте эту справочную информацию для исправления запроса:" + Символы.ПС + Символы.ПС +
				ИИА_Сервер.ПолучитьСправкуЗапросовПоОшибке(ТекстОшибки);
			КонецЕсли;
			ИИА_Сервер.ДобавитьСообщениеВДиалог(
				СсылкаДиалога,
				Перечисления.ИИА_АвторСообщения.Система,
				Перечисления.ИИА_ТипСообщения.Текст,
				ТекстСправки,
				"",
				"",
				0
			);
		КонецЕсли;
		
		ИИА_Сервер.ДобавитьСообщениеВДиалог(
			СсылкаДиалога,
			Перечисления.ИИА_АвторСообщения.Система,
			Перечисления.ИИА_ТипСообщения.Ошибка,
			ТекстОшибки,
			"",
			"",
			0
		);
	КонецЕсли;
	
	Возврат РезультатDSL;
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьТолькоЧтениеDSL(СсылкаДиалога)
	ТолькоЧтение = Ложь;
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат ТолькоЧтение;
	КонецЕсли;
	
	ИИА_Сервер.ИнициализироватьКонтекстАрхитектуры(СсылкаДиалога);
	ТолькоЧтение = (СсылкаДиалога.ТипДиалога = Перечисления.ИИА_ТипДиалога.Запрос1С);
	
	Попытка
		Диалог = СсылкаДиалога.ПолучитьОбъект();
		НастройкиПольз = ИИА_Сервер.ПолучитьНастройкиПользователя(Диалог.Пользователь);
		Если НастройкиПольз.Свойство("ДоступнаЗапись") И НЕ НастройкиПольз.ДоступнаЗапись Тогда
			ТолькоЧтение = Истина;
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ТолькоЧтение;
КонецФункции

#КонецОбласти
#КонецОбласти
